#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "rus");
	int i, j, m;
	cout << " Выберите место из таблицы " << endl;
	cout << "            1   2   3   4   5   6   7   8   9   10 " << endl;
	cout << "           _______________________________________" << endl;
	for (int i = 1; i <= 5; i++)
	{
		cout << i << " этаж ";

		cout << "   |___|___|___|___|___|___|___|___|___|___| " << endl;
	} 
	cout << "Введите этаж: ";
	cin >> j;
    	while ((j < 1) or (j > 5))
     	{
     		cout << "Вы ввели несуществующий этаж, введите еще раз " << endl;
		    cin >> j;
    	}

	cout << "Введите номер парковочного места: ";
	cin >> m;
	    while ((m<1)or(m>10))
     	{
			cout << "Вы ввели несуществующее парковочное место, введите еще раз " << endl; 
			cin >> m;
	    }
		cout << "Вы забронировали " << m << " парковочное место на " << j << " этаже." << endl;
		int parkovka[5][10] = {};
		parkovka[j][m] = 1;
		cout << "Желаете ли вы забронировать еще одно место. Введите 1 если да 0 если нет" << endl;
		int c;
		cin >> c;
		if (c==1)
		{
			while (parkovka[j][m]==1)
			{
				cout << "Введите этаж: ";
				cin >> j;
				while ((j<1)or (j>5))
				{
					cout << "Вы ввели несуществующий этаж, введите еще раз. " << endl;
					cin >> j;
				}
				cout << "Введите номер парковачного места: ";
				cin >> j;

				while ((m<1)or (m>10))
				{
					cout << "Вы ввели несуществующее парковочное место, введите еще раз. " << endl;
					cin >> m;
					cout << "Вы забронировали " << m << " парковочное место на " << j << " этаже." << endl;
				}
				if (parkovka[j][m]== 1)
				{
					cout << "Это место забронировано выберите другое.\n";
				}
				else
				{
					cout << "Вы забронировали " << m << " парковочное место на " << j << " этаже.\n";
					break;
				}
			}
		}
}